tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "srkomodo/tap"
tap "microsoft/git"
tap "zegervdv/zathura"

brew "act"
brew "actionlint"
brew "awscli"
brew "bash"
brew "bats-core"
brew "glib"
brew "carthage"
brew "circleci", link: false
brew "colordiff"
brew "coreutils"
brew "datamash"
brew "ddcctl"
brew "entr"
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "git-vendor"
brew "github-markdown-toc"
brew "gh"
brew "gnu-getopt"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "gnupg@1.4", link: false
brew "gomplate"
brew "goreleaser"
brew "graphviz"
brew "grep"
brew "gron"
brew "gum"
brew "httpie"
brew "ical-buddy"
brew "jfrog-cli"
brew "make"
brew "markdown"
brew "moreutils"
brew "mas"
brew "neovim"
brew "openssl"
brew "pandoc"
brew "parallel", args: ["force", "overwrite"]
brew "pinentry-mac"
brew "podman"
# Don't install python here; use pyenv to install it.
brew "python-yq"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "semgrep"
brew "shellcheck"
brew "skopeo"
brew "sqlite3"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "trivy"
brew "util-linux"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykpers"
brew "ykman"
brew "xz"
brew "zathura"
brew "zlib"

cask "aerial"
cask "affinity-publisher"
cask "alt-tab"
cask "docker"
cask "finicky"
cask "font-hack-nerd-font"
cask "font-liberation-nerd-font"
cask "microsoft/git/git-credential-manager-core"
cask "keybase"
cask "keycastr"
cask "kitty"
cask "ksdiff"
cask "meld"
cask "netnewswire"
cask "openaudible"
cask "p4v"
cask "parallels"
cask "vlc"
cask "vscodium"
cask "wkhtmltopdf"

mas "1Password 7",                 id: 1333542190
mas "Adblock Plus for Safari ABP", id: 1432731683
mas "Affinity Designer",           id: 824171161
mas "Developer",                   id: 640199958
mas "Garageband",                  id: 682658836
mas "iMovie",                      id: 408981434
mas "Kaleidoscope",                id: 1575557335
mas "Keynote",                     id: 409183694
mas "Noir",                        id: 1592917505
mas "Numbers",                     id: 409203825
mas "Pages",                       id: 409201541
mas "Vectornator",                 id: 1219074514
mas "Xcode",                       id: 497799835
