tap "homebrew/bundle"
tap "microsoft/git"
tap "shaunsingh/SFMono-Nerd-Font-Ligaturized"

brew "actionlint"
brew "awscli"
brew "bash"
brew "bats-core"
brew "glib"
brew "colordiff"
brew "coreutils"
brew "d2"
brew "datamash"
brew "ddcctl"
brew "entr"
brew "fd" # find alternative
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "git"
brew "git-lfs"
brew "git-vendor"
brew "github-markdown-toc"
brew "gh"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "gnupg@1.4", link: false
brew "gomplate"
brew "goreleaser"
brew "graphviz"
brew "grep"
brew "gron"
brew "gum"
brew "httpie"
brew "ical-buddy"
# need to make java available to system via:
#    $ sudo ln -sfn /opt/homebrew/opt/openjdk/libexec/openjdk.jdk \
#        /Library/Java/JavaVirtualMachines/openjdk.jdk
#brew "java" 
brew "jid" # json incremental digger
#brew "jfrog-cli"
brew "jless"
brew "make"
brew "markdown"
brew "moreutils"
brew "mas"
# neovim head install requires utf8proc head install
brew "neovim", head: true
brew "openssl"
brew "pandoc"
brew "par" # paragraph formatting
brew "parallel", args: ["force", "overwrite"]
brew "pinentry-mac"
brew "podman"
# Don't install python here; use pyenv to install it.
brew "prettier"
# Don't install protobuf, protoc-gen-go, or protoc-gen-go-grpc here, use go install.
brew "python-yq"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "semgrep"
brew "shellcheck"
brew "skopeo"
brew "sqlite3"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
# utf8proc head required by neovim head.
brew "utf8proc", head: true
brew "util-linux"
#brew "vim"
brew "watch"
brew "watchman"
brew "wget"
#brew "yamllint"
brew "yarn"
#brew "ykpers"
#brew "ykman"
#brew "xz"
brew "zlib"

#cask "betterdisplay"
#cask "displaylink"
cask "font-hack-nerd-font"
cask "font-liberation-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "kitty"
cask "netnewswire"
cask "openaudible"
#cask "switchresx"
cask "vlc"

#mas "Developer",                   id: 640199958
#mas "Garageband",                  id: 682658836
#mas "iMovie",                      id: 408981434
#mas "Keynote",                     id: 409183694
#mas "Noir",                        id: 1592917505
#mas "Numbers",                     id: 409203825
#mas "Pages",                       id: 409201541
#mas "Xcode",                       id: 497799835
