tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "srkomodo/tap"
brew "act"
brew "actionlint"
brew "awscli"
brew "bash"
brew "bats-core"
brew "glib"
brew "carthage"
brew "circleci", link: false
brew "coreutils"
brew "ddcctl"
brew "entr"
brew "findutils"
brew "gawk"
brew "git-vendor"
brew "github-markdown-toc"
brew "gh"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "gnupg@1.4", link: false
brew "gomplate"
brew "graphviz"
brew "grep"
brew "gron"
brew "httpie"
brew "ical-buddy"
brew "jfrog-cli"
brew "make"
brew "markdown"
brew "moreutils"
brew "mas"
brew "neovim"
brew "openssl"
brew "pandoc"
brew "parallel", args: ["force", "overwrite"]
brew "pinentry-mac"
# No, use pyenv to install python!
# NO! brew "python"
# NO! brew "python3"
brew "python-yq"
brew "readline"
brew "shellcheck"
brew "sqlite3"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "util-linux"
brew "watch"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykpers"
brew "ykman"
brew "xz"
brew "zlib"

cask "aerial"
cask "alt-tab"
cask "docker"
cask "keybase"
cask "keycastr"
cask "kitty"
cask "ksdiff"
cask "parallels"
cask "wkhtmltopdf"
